lod2authstatwb/doc/webid.org
#+STYLE:<style type="text/css">body{ width: 720px; margin: 0 auto; background-color: #FDFDFD; padding: 20px; border: solid gray 1px; text-align:justify; } h2 { border-style: solid; border-width: 0 0 2px 0; color: rgb(0, 0, 114); }</style>

Setting up WEBID authentication for the lod2 stat workbench

* Script
The steps that are taken in this file are combined in a script that is run when one installs the lod2statworkbench debian package. The script is located under src/main/tomcatscript. It is good to give it a quick look to see the full workflow. The steps concerning [[Handling invalid certificates]] are optional and are as such not included in the script.
* Server configuration
** Required libraries
In order to secure the tomcat server, we will need a number of additional libraries. The [[http://webid.turnguard.com/WebIDTestServer/docs/installation][webid realm page]] holds a list of the required libraries:

- com-turnguard-advanced-webid-tomcat-6.0.32.jar
- jsslutils-1.0.5.jar
- jsslutils-extra-apachetomcat6-1.0.5.jar
- log4j-1.2.14.jar
- sesame-onejar-2.3.1.jar
- slf4j-api-1.5.3.jar
- slf4j-log4j12-1.5.3.jar
- sesame-rio-rdfa-3.0.0-SNAPSHOT.jar
- xml-resolver-1.2.jar
- catalogs.tar.gz

These files should be added to the tomcat\_root/lib folder, so they can be shared between the tomcat server and the applications.
** Keystore and Truststore
We need to setup a keystore and a truststore for the tomcat server, as described on https://grips.semantic-web.at/display/LOD2/WebIDRealm+Installation+Protocol. I will repeat the information that I found there for convenience:

creating a keystore
#+begin_src bash
  cd /var/lib/tomcat6/conf
keytool -genkey -v -alias tomcat -keyalg RSA -validity 3650 -keystore /var/lib/tomcat6/conf/tomcat.keystore -dname "CN=demo.lod2.eu, OU=demo, O=lod2"
#+end_src
creating a truststore
#+begin_src bash
  cd /var/lib/tomcat6/conf
keytool -genkey -v -alias demoKey -keyalg RSA -storetype PKCS12 -keystore demo.p12 -dname "CN=demoKey, OU=demo, O=DieOrg"
#+end_src
export demo.cer
#+begin_src bash
cd /var/lib/tomcat6/conf
keytool -export -alias demoKey -keystore demo.p12 -storetype PKCS12 -rfc -file demo.cer
#+end_src
import demo.cer into keystore
#+begin_src bash
cd /var/lib/tomcat6/conf
keytool -import -v -file demo.cer -keystore tomcat.keystore
#+end_src
Note: as noted in the following section, I had some problems when using the truststore. The truststore, however is optional

** Setting up an SSL connection
To run the server over SSL, we need to set up a new Connection element in the tomcat server.xml file. The connection should look like this:

#+begin_src xml
  <Connector
      port="8443"      SSLImplementation="org.jsslutils.extra.apachetomcat6.JSSLutilsImplementation"
      acceptAnyCert="true"
      scheme="https"
      maxThreads="150"
      secure="true"
      SSLEnabled="true"
      sslProtocol="TLS"
      clientAuth="true"
      keystoreFile="/var/lib/tomcat6/conf/tomcat.keystore"
      keystorePass="password"/>
#+end_src

In this xml element, the location of the keystore File has been provided, together with its password. It is possible to provide a keystoreType field as well, but in my case, I used the default type: JKS. The guide on the grips page also mentions a truststore. However, I did not succeed in getting this to work. The use of the truststore gave me some java exceptions, I suspect the versions of the libraries that I have are not in sync with each other, even though I got them from the grips page. It would be too much effort to look for a matching set as for demonstration purposes, a truststore is not really necessary.

In case a truststore is used, the connector would need the following properties as well:
#+begin_src xml
  <Connector
    truststoreFile="/var/lib/tomcat6/conf/tomcat.truststore"
    truststorePass="password"
    truststoreType="PKCS12"/>
#+end_src


In case a truststore is used and configured as described above, do not forget the turstoreType property. We are not using the default for the truststore.

