lod2authstatwb/doc/webid.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Setting up WEBID authentication for the lod2 stat workbench</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-30 13:50:21 CEST"/>
<meta name="author" content="Karel Kremer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Setting up WEBID authentication for the lod2 stat workbench</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Script </a></li>
<li><a href="#sec-2">2 Server configuration </a>
<ul>
<li><a href="#sec-2.1">2.1 Required libraries </a></li>
<li><a href="#sec-2.2">2.2 Keystore and Truststore </a></li>
<li><a href="#sec-2.3">2.3 Setting up an SSL connection </a></li>
<li><a href="#sec-2.4">2.4 Using Virtuoso to store access rules </a></li>
<li><a href="#sec-2.5">2.5 Adding roles to the server </a></li>
<li><a href="#sec-2.6">2.6 Handling invalid certificates </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Configuring the web application </a>
<ul>
<li><a href="#sec-3.1">3.1 URL based security </a></li>
<li><a href="#sec-3.2">3.2 Application based security </a></li>
<li><a href="#sec-3.3">3.3 Application Dependencies </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Files </a>
<ul>
<li><a href="#sec-4.1">4.1 server.xml </a></li>
<li><a href="#sec-4.2">4.2 web.xml </a></li>
<li><a href="#sec-4.3">4.3 context.xml </a></li>
<li><a href="#sec-4.4">4.4 tomcat-users.rdf </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Sources </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Script </h2>
<div class="outline-text-2" id="text-1">

<p>The steps that are taken in this file are combined in a script <a href="#sec-1">TODO link</a>  that is run when one installs the lod2statworkbench debian package. The script is also located in the svn under src/main/tomcatscript. It is good to give it a quick look to see the full workflow. The steps concerning <a href="#sec-1">Handling invalid certificates</a> are optional and are as such not included in the script.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Server configuration </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Required libraries </h3>
<div class="outline-text-3" id="text-2.1">

<p>In order to secure the tomcat server, we will need a number of additional libraries. The <a href="http://webid.turnguard.com/WebIDTestServer/docs/installation">webid realm page</a> holds a list of the required libraries:
</p>
<ul>
<li>
com-turnguard-advanced-webid-tomcat-6.0.32.jar
</li>
<li>
jsslutils-1.0.5.jar
</li>
<li>
jsslutils-extra-apachetomcat6-1.0.5.jar
</li>
<li>
log4j-1.2.14.jar
</li>
<li>
sesame-onejar-2.3.1.jar
</li>
<li>
slf4j-api-1.5.3.jar
</li>
<li>
slf4j-log4j12-1.5.3.jar
</li>
<li>
sesame-rio-rdfa-3.0.0-SNAPSHOT.jar
</li>
<li>
xml-resolver-1.2.jar
</li>
<li>
catalogs.tar.gz

</li>
</ul>

<p>These files should be added to the tomcat_root/lib folder, so they can be shared between the tomcat server and the applications.
</p></div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Keystore and Truststore </h3>
<div class="outline-text-3" id="text-2.2">

<p>We need to setup a keystore and a truststore for the tomcat server, as described on <a href="https://grips.semantic-web.at/display/LOD2/WebIDRealm+Installation+Protocol">https://grips.semantic-web.at/display/LOD2/WebIDRealm+Installation+Protocol</a>. I will repeat the information that I found there for convenience:
</p>
<p>
creating a keystore
</p>


<pre class="src src-bash">  cd /var/lib/tomcat7/conf
keytool -genkey -v -alias tomcat -keyalg RSA -validity 3650 -keystore /var/lib/tomcat7/conf/tomcat.keystore -dname <span style="color: #bc8f8f;">"CN=demo.lod2.eu, OU=demo, O=lod2"</span>
</pre>



<p>
creating a truststore
</p>


<pre class="src src-bash">  cd /var/lib/tomcat7/conf
keytool -genkey -v -alias demoKey -keyalg RSA -storetype PKCS12 -keystore demo.p12 -dname <span style="color: #bc8f8f;">"CN=demoKey, OU=demo, O=DieOrg"</span>
</pre>



<p>
export demo.cer
</p>


<pre class="src src-bash">cd /var/lib/tomcat7/conf
keytool -export -alias demoKey -keystore demo.p12 -storetype PKCS12 -rfc -file demo.cer
</pre>



<p>
import demo.cer into keystore
</p>


<pre class="src src-bash">cd /var/lib/tomcat7/conf
keytool -import -v -file demo.cer -keystore tomcat.keystore
</pre>



<p>
Note: as noted in the following section, I had some problems when using the truststore. The truststore, however is optional
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Setting up an SSL connection </h3>
<div class="outline-text-3" id="text-2.3">

<p>To run the server over SSL, we need to set up a new Connection element in the tomcat server.xml file. The connection should look like this:
</p>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">Connector</span>
    <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">8443</span><span style="color: #bc8f8f;">"</span>      <span style="color: #b8860b;">SSLImplementation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.jsslutils.extra.apachetomcat6.JSSLutilsImplementation</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">acceptAnyCert</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">scheme</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">https</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">maxThreads</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">150</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">secure</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">SSLEnabled</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">sslProtocol</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">TLS</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">clientAuth</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">keystoreFile</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/var/lib/tomcat7/conf/tomcat.keystore</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">keystorePass</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">password</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>




<p>
In this xml element, the location of the keystore File has been provided, together with its password. It is possible to provide a keystoreType field as well, but in my case, I used the default type: JKS. The guide on the grips page also mentions a truststore. However, I did not succeed in getting this to work. The use of the truststore gave me some java exceptions, I suspect the versions of the libraries that I have are not in sync with each other, even though I got them from the grips page. It would be too much effort to look for a matching set as for demonstration purposes, a truststore is not really necessary.
</p>
<p>
In case a truststore is used, the connector would need the following properties as well:
</p>


<pre class="src src-xml">&lt;<span style="color: #0000ff;">Connector</span>
  <span style="color: #b8860b;">truststoreFile</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/var/lib/tomcat7/conf/tomcat.truststore</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #b8860b;">truststorePass</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">password</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #b8860b;">truststoreType</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">PKCS12</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>



</div>

</div>
