lod2authstatwb/doc/webid.org
** Using Virtuoso to store access rules
The lod2 stat workbench uses Virtuoso to store the information we have on user rights. This means we need to add a Resource element to the server.xml file as well:
#+begin_src xml
  <Resource
      name="WebIDDatabase" auth="Container"
      type="com.turnguard.webid.tomcat.database.WebIDDatabase"
      description="Using virtuoso as roles sources"
      factory="com.turnguard.webid.tomcat.database.impl.virtuoso.VirtuosoWebIDDatabaseFactoryImpl"            
      roleGraph="http://webidrealm.localhost/rolegraph"
      host="localhost"
      port="1111"
      user="dba"
      pass="lod2"/>
#+end_src

Note the name of the role graph that is to be used for virtuoso.

** Adding roles to the server
The server will need to know which roles are available for which users. To that end, an rdf graph will have to be created at the virtuoso endpoint, holding the correct triples. An example of such a graph can be found in the [[Files][files section]].

** Handling invalid certificates
It is possible that the user does not present a valid certificate to the server. Because we have set clientAuth="true", the user will always be asked to present a certificate (we could have used "Want", but we didn't). To avoid the ugly 117 error page that will not mean anything to the user, we can set the custom error page for the 117 exception in the tomcat web.xml file. 

#+begin_src xml
<error-page>

<error-code>117</error-code>

<location>/invalidcertificate.html</location>

</error-page>
#+end_src

The html page should be added to the tomcat ROOT folder in the webapps directory and it should give the user an explanation on what went wrong so he can solve it.

* Configuring the web application
** URL based security
The web application can be secured on URL level. To specify the protected url patterns and the roles that can access them, the web.xml file needs to be edited. The following elements should be added:

#+begin_src xml
  <security-constraint>
      <display-name>Stat</display-name>
      <web-resource-collection>
          <web-resource-name>stat</web-resource-name>
          <url-pattern>/stat/*</url-pattern>
      </web-resource-collection>
      <auth-constraint>
          <role-name>http://demo.lod2.eu/Role/Administrator</role-name>
      </auth-constraint>
      <user-data-constraint>
          <transport-guarantee>CONFIDENTIAL</transport-guarantee>
      </user-data-constraint>
  </security-constraint>
  <security-role>
      <role-name>http://demo.lod2.eu/Role/Administrator</role-name>
  </security-role>
#+end_src
Note that for every role-name that is used in the auth-constraints of a security-constraint, a security-role must be created.

In order for the application to know which resource to use for discovering the roles, the context.xml file must be configured as well. The following elements should be added:

#+begin_src xml
<Valve className="org.apache.catalina.authenticator.SSLAuthenticator"/>
<Realm className="com.turnguard.webid.tomcat.realm.WebIDRealm" resourceName="WebIDDatabase" validate="false"/>
#+end_src
** Application based security
The user that is logged in can also be requested at runtime. This means that the application itself can present specific behavior based on the roles of the current user. To do this, the application can use for instance the following procedure: 
#+begin_src java
  String userName=((WebIDUser) user).getURI().toString();
  RepositoryConnection connection=state.rdfStore.getConnection();
  TupleQueryResult results=
      connection.prepareTupleQuery(QueryLanguage.SPARQL, "SELECT ?role FROM <" +
                                   state.getUserGraph() + "> " +
                                   "WHERE { " +
                                   "<" + userName + "> <http://schema.turnguard.com/webid/2.0/core#hasRole> ?role" +
                                   "}").evaluate();
  boolean allowed=false;
  while(results.hasNext()){
      BindingSet bindings=results.next();
      String role=bindings.getBinding("role").getValue().stringValue();
      if(role!=null && this.getAcceptedRoles().contains(role)){
          allowed=true;
          break;
      }
  } 
  if(allowed){
      // do the cool stuff
  }else {
      // do less cool stuff
  }
#+end_src
