lod2authstatwb/doc/webid.html

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Using Virtuoso to store access rules </h3>
<div class="outline-text-3" id="text-2.4">

<p>The lod2 stat workbench uses Virtuoso to store the information we have on user rights. This means we need to add a Resource element to the server.xml file as well:
</p>


<pre class="src src-xml">&lt;<span style="color: #0000ff;">Resource</span>
    <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">WebIDDatabase</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">auth</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Container</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.database.WebIDDatabase</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">description</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Using virtuoso as roles sources</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">factory</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.database.impl.virtuoso.VirtuosoWebIDDatabaseFactoryImpl</span><span style="color: #bc8f8f;">"</span>            
    <span style="color: #b8860b;">roleGraph</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://webidrealm.localhost/rolegraph</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">host</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">localhost</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1111</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">user</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dba</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">pass</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">lod2</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>




<p>
Note the name of the role graph that is to be used for virtuoso.
</p>
</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> Adding roles to the server </h3>
<div class="outline-text-3" id="text-2.5">

<p>The server will need to know which roles are available for which users. To that end, an rdf graph will have to be created at the virtuoso endpoint, holding the correct triples. An example of such a graph can be found in the <a href="#sec-2.1">files section</a>.
</p>
</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> Handling invalid certificates </h3>
<div class="outline-text-3" id="text-2.6">

<p>It is possible that the user does not present a valid certificate to the server. Because we have set clientAuth="true", the user will always be asked to present a certificate (we could have used "Want", but we didn't). To avoid the ugly 117 error page that will not mean anything to the user, we can set the custom error page for the 117 exception in the tomcat web.xml file. 
</p>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">error-page</span>&gt;

&lt;<span style="color: #0000ff;">error-code</span>&gt;117&lt;/<span style="color: #0000ff;">error-code</span>&gt;

&lt;<span style="color: #0000ff;">location</span>&gt;/invalidcertificate.html&lt;/<span style="color: #0000ff;">location</span>&gt;

&lt;/<span style="color: #0000ff;">error-page</span>&gt;
</pre>




<p>
The html page should be added to the tomcat ROOT folder in the webapps directory and it should give the user an explanation on what went wrong so he can solve it.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Configuring the web application </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> URL based security </h3>
<div class="outline-text-3" id="text-3.1">

<p>The web application can be secured on URL level. To specify the protected url patterns and the roles that can access them, the web.xml file needs to be edited. The following elements should be added:
</p>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">security-constraint</span>&gt;
    &lt;<span style="color: #0000ff;">display-name</span>&gt;Stat&lt;/<span style="color: #0000ff;">display-name</span>&gt;
    &lt;<span style="color: #0000ff;">web-resource-collection</span>&gt;
        &lt;<span style="color: #0000ff;">web-resource-name</span>&gt;stat&lt;/<span style="color: #0000ff;">web-resource-name</span>&gt;
        &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/stat/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
    &lt;/<span style="color: #0000ff;">web-resource-collection</span>&gt;
    &lt;<span style="color: #0000ff;">auth-constraint</span>&gt;
        &lt;<span style="color: #0000ff;">role-name</span>&gt;http://demo.lod2.eu/Role/Administrator&lt;/<span style="color: #0000ff;">role-name</span>&gt;
    &lt;/<span style="color: #0000ff;">auth-constraint</span>&gt;
    &lt;<span style="color: #0000ff;">user-data-constraint</span>&gt;
        &lt;<span style="color: #0000ff;">transport-guarantee</span>&gt;CONFIDENTIAL&lt;/<span style="color: #0000ff;">transport-guarantee</span>&gt;
    &lt;/<span style="color: #0000ff;">user-data-constraint</span>&gt;
&lt;/<span style="color: #0000ff;">security-constraint</span>&gt;
&lt;<span style="color: #0000ff;">security-role</span>&gt;
    &lt;<span style="color: #0000ff;">role-name</span>&gt;http://demo.lod2.eu/Role/Administrator&lt;/<span style="color: #0000ff;">role-name</span>&gt;
&lt;/<span style="color: #0000ff;">security-role</span>&gt;
</pre>



<p>
Note that for every role-name that is used in the auth-constraints of a security-constraint, a security-role must be created.
</p>
<p>
In order for the application to know which resource to use for discovering the roles, the context.xml file must be configured as well. The following elements should be added:
</p>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">Valve</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.authenticator.SSLAuthenticator</span><span style="color: #bc8f8f;">"</span>/&gt;
&lt;<span style="color: #0000ff;">Realm</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.realm.WebIDRealm</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">resourceName</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">WebIDDatabase</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">validate</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>



</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Application based security </h3>
<div class="outline-text-3" id="text-3.2">

<p>The user that is logged in can also be requested at runtime. This means that the application itself can present specific behavior based on the roles of the current user. To do this, the application can use for instance the following procedure: 
</p>


<pre class="src src-java"><span style="color: #228b22;">String</span> <span style="color: #b8860b;">userName</span>=((<span style="color: #228b22;">WebIDUser</span>) user).getURI().toString();
<span style="color: #228b22;">RepositoryConnection</span> <span style="color: #b8860b;">connection</span>=state.rdfStore.getConnection();
<span style="color: #228b22;">TupleQueryResult</span> <span style="color: #b8860b;">results</span>=
    connection.prepareTupleQuery(<span style="color: #5f9ea0;">QueryLanguage</span>.SPARQL, <span style="color: #bc8f8f;">"SELECT ?role FROM &lt;"</span> +
                                 state.getUserGraph() + <span style="color: #bc8f8f;">"&gt; "</span> +
                                 <span style="color: #bc8f8f;">"WHERE { "</span> +
                                 <span style="color: #bc8f8f;">"&lt;"</span> + userName + <span style="color: #bc8f8f;">"&gt; &lt;<a href="http://schema.turnguard.com/webid/2.0/core#hasRole">http://schema.turnguard.com/webid/2.0/core#hasRole</a>&gt; ?role"</span> +
                                 <span style="color: #bc8f8f;">"}"</span>).evaluate();
<span style="color: #228b22;">boolean</span> <span style="color: #b8860b;">allowed</span>=<span style="color: #5f9ea0;">false</span>;
<span style="color: #a020f0;">while</span>(results.hasNext()){
    <span style="color: #228b22;">BindingSet</span> <span style="color: #b8860b;">bindings</span>=results.next();
    <span style="color: #228b22;">String</span> <span style="color: #b8860b;">role</span>=bindings.getBinding(<span style="color: #bc8f8f;">"role"</span>).getValue().stringValue();
    <span style="color: #a020f0;">if</span>(role!=<span style="color: #5f9ea0;">null</span> &amp;&amp; <span style="color: #a020f0;">this</span>.getAcceptedRoles().contains(role)){
        allowed=<span style="color: #5f9ea0;">true</span>;
        <span style="color: #a020f0;">break</span>;
    }
} 
<span style="color: #a020f0;">if</span>(allowed){
    <span style="color: #b22222;">// </span><span style="color: #b22222;">do the cool stuff
</span>}<span style="color: #a020f0;">else</span> {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">do less cool stuff
</span>}
</pre>



</div>

</div>
