lod2authstatwb/doc/webid.html

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> Application Dependencies </h3>
<div class="outline-text-3" id="text-3.3">

<p>Because both the virtuoso and the application need to make use of some libraries (for interacting with virtuoso and turnguard webid for instance), some application dependencies should be marked as <b>provided</b> in the pom file. If this is not configured like this, the libraries will be loaded twice, by different class loaders. This is a problem when using the application based security that is laid out above. The cast to WEBIDUser will fail, as the user was loaded by the library that is used in the tomcat7 server, while the cast is made to the version in the library used in the application. 
</p>
<p>
This is important, as the application now assumes that the tomcat instance has been properly configured. To that end, a script was written that takes care of the configuration.
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Files </h2>
<div class="outline-text-2" id="text-4">

<p>This section holds all the files that were used in this document. Passwords have been set to defaults.
</p>
</div>
