lod2authstatwb/doc/webid.html

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> server.xml </h3>
<div class="outline-text-3" id="text-4.1">




<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #b8860b;">version</span>=<span style="color: #bc8f8f;">'</span><span style="color: #bc8f8f;">1.0</span><span style="color: #bc8f8f;">'</span> <span style="color: #b8860b;">encoding</span>=<span style="color: #bc8f8f;">'</span><span style="color: #bc8f8f;">utf-8</span><span style="color: #bc8f8f;">'</span>?&gt;
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
  Licensed to the Apache Software Foundation (ASF) under one or more
  contributor license agreements.  See the NOTICE file distributed with
  this work for additional information regarding copyright ownership.
  The ASF licenses this file to You under the Apache License, Version 2.0
  (the "License"); you may not use this file except in compliance with
  the License.  You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.
</span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Note:  A "Server" is not itself a "Container", so you may not
     define subcomponents such as "Valves" at this level.
     Documentation at /docs/config/server.html
 </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">Server</span> <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">8005</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">shutdown</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">SHUTDOWN</span><span style="color: #bc8f8f;">"</span>&gt;

  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">APR library loader. Documentation at /docs/apr.html </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
  &lt;Listener className="org.apache.catalina.core.AprLifecycleListener" SSLEngine="on" /&gt;
  </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">Initialize Jasper prior to webapps are loaded. Documentation at /docs/jasper-howto.html </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">Listener</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.core.JasperListener</span><span style="color: #bc8f8f;">"</span> /&gt;
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Prevent memory leaks due to use of particular java/javax APIs</span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">Listener</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.core.JreMemoryLeakPreventionListener</span><span style="color: #bc8f8f;">"</span> /&gt;
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> JMX Support for the Tomcat server. Documentation at /docs/non-existent.html </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">Listener</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.mbeans.ServerLifecycleListener</span><span style="color: #bc8f8f;">"</span> /&gt;
  &lt;<span style="color: #0000ff;">Listener</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.mbeans.GlobalResourcesLifecycleListener</span><span style="color: #bc8f8f;">"</span> /&gt;

  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Global JNDI resources
       Documentation at /docs/jndi-resources-howto.html
  </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">GlobalNamingResources</span>&gt;
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Editable user database that can also be used by
         UserDatabaseRealm to authenticate users
    </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">Resource</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UserDatabase</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">auth</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Container</span><span style="color: #bc8f8f;">"</span>
              <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.UserDatabase</span><span style="color: #bc8f8f;">"</span>
              <span style="color: #b8860b;">description</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">User database that can be updated and saved</span><span style="color: #bc8f8f;">"</span>
              <span style="color: #b8860b;">factory</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.users.MemoryUserDatabaseFactory</span><span style="color: #bc8f8f;">"</span>
              <span style="color: #b8860b;">pathname</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">conf/tomcat-users.xml</span><span style="color: #bc8f8f;">"</span> /&gt; 
     &lt;<span style="color: #0000ff;">Resource</span>
                <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">WebIDDatabase</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">auth</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Container</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.database.WebIDDatabase</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">description</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Using virtuoso as roles sources</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">factory</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.database.impl.virtuoso.VirtuosoWebIDDatabaseFactoryImpl</span><span style="color: #bc8f8f;">"</span>            
                <span style="color: #b8860b;">roleGraph</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://webidrealm.localhost/rolegraph</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">host</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">localhost</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1111</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">user</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dba</span><span style="color: #bc8f8f;">"</span>
                <span style="color: #b8860b;">pass</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dba</span><span style="color: #bc8f8f;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">GlobalNamingResources</span>&gt;

  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> A "Service" is a collection of one or more "Connectors" that share
       a single "Container" Note:  A "Service" is not itself a "Container", 
       so you may not define subcomponents such as "Valves" at this level.
       Documentation at /docs/config/service.html
   </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">Service</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Catalina</span><span style="color: #bc8f8f;">"</span>&gt;
  
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">The connectors can use a shared executor, you can define one or more named thread pools</span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
    &lt;Executor name="tomcatThreadPool" namePrefix="catalina-exec-" 
        maxThreads="150" minSpareThreads="4"/&gt;
    </span><span style="color: #b22222;">--&gt;</span>
    
    
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> A "Connector" represents an endpoint by which requests are received
         and responses are returned. Documentation at :
         Java HTTP Connector: /docs/config/http.html (blocking &amp; non-blocking)
         Java AJP  Connector: /docs/config/ajp.html
         APR (HTTP/AJP) Connector: /docs/apr.html
         Define a non-SSL HTTP/1.1 Connector on port 8080
    </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">Connector</span> <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">8080</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">protocol</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">HTTP/1.1</span><span style="color: #bc8f8f;">"</span> 
               <span style="color: #b8860b;">connectionTimeout</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">20000</span><span style="color: #bc8f8f;">"</span> 
               <span style="color: #b8860b;">URIEncoding</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UTF-8</span><span style="color: #bc8f8f;">"</span>
               <span style="color: #b8860b;">redirectPort</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">8443</span><span style="color: #bc8f8f;">"</span> /&gt;
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> A "Connector" using the shared thread pool</span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
    &lt;Connector executor="tomcatThreadPool"
               port="8080" protocol="HTTP/1.1" 
               connectionTimeout="20000" 
               redirectPort="8443" /&gt;
    </span><span style="color: #b22222;">--&gt;</span>           
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Define a SSL HTTP/1.1 Connector on port 8443
         This connector uses the JSSE configuration, when using APR, the 
         connector should be using the OpenSSL style configuration
         described in the APR documentation </span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
    &lt;Connector port="8443" protocol="HTTP/1.1" SSLEnabled="true"
               maxThreads="150" scheme="https" secure="true"
               clientAuth="false" sslProtocol="TLS" /&gt;
    </span><span style="color: #b22222;">--&gt;</span>
     &lt;<span style="color: #0000ff;">Connector</span>
    <span style="color: #b8860b;">port</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">8443</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">SSLImplementation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.jsslutils.extra.apachetomcat6.JSSLutilsImplementation</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">acceptAnyCert</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">scheme</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">https</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">maxThreads</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">150</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">secure</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">SSLEnabled</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">sslProtocol</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">TLS</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">clientAuth</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">keystoreFile</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/var/lib/tomcat7/conf/tomcat.keystore</span><span style="color: #bc8f8f;">"</span>
    <span style="color: #b8860b;">keystorePass</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">password</span><span style="color: #bc8f8f;">"</span>/&gt;

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Define an AJP 1.3 Connector on port 8009 </span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
    &lt;Connector port="8009" protocol="AJP/1.3" redirectPort="8443" /&gt;
    </span><span style="color: #b22222;">--&gt;</span>


    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> An Engine represents the entry point (within Catalina) that processes
         every request.  The Engine implementation for Tomcat stand alone
         analyzes the HTTP headers included with the request, and passes them
         on to the appropriate Host (virtual host).
         Documentation at /docs/config/engine.html </span><span style="color: #b22222;">--&gt;</span>

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> You should set jvmRoute to support load-balancing via AJP ie :
    &lt;Engine name="Catalina" defaultHost="localhost" jvmRoute="jvm1"&gt;         
    </span><span style="color: #b22222;">--&gt;</span> 
    &lt;<span style="color: #0000ff;">Engine</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">Catalina</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">defaultHost</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">localhost</span><span style="color: #bc8f8f;">"</span>&gt;

      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">For clustering, please take a look at documentation at:
          /docs/cluster-howto.html  (simple how to)
          /docs/config/cluster.html (reference documentation) </span><span style="color: #b22222;">--&gt;</span>
      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
      &lt;Cluster className="org.apache.catalina.ha.tcp.SimpleTcpCluster"/&gt;
      </span><span style="color: #b22222;">--&gt;</span>        

      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> The request dumper valve dumps useful debugging information about
           the request and response data received and sent by Tomcat.
           Documentation at: /docs/config/valve.html </span><span style="color: #b22222;">--&gt;</span>
      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
      &lt;Valve className="org.apache.catalina.valves.RequestDumperValve"/&gt;
      </span><span style="color: #b22222;">--&gt;</span>

      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> This Realm uses the UserDatabase configured in the global JNDI
           resources under the key "UserDatabase".  Any edits
           that are performed against this UserDatabase are immediately
           available for use by the Realm.  </span><span style="color: #b22222;">--&gt;</span>
      &lt;<span style="color: #0000ff;">Realm</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.realm.UserDatabaseRealm</span><span style="color: #bc8f8f;">"</span>
             <span style="color: #b8860b;">resourceName</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UserDatabase</span><span style="color: #bc8f8f;">"</span>/&gt;

      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Define the default virtual host
           Note: XML Schema validation will not work with Xerces 2.2.
       </span><span style="color: #b22222;">--&gt;</span>
      &lt;<span style="color: #0000ff;">Host</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">localhost</span><span style="color: #bc8f8f;">"</span>  <span style="color: #b8860b;">appBase</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">webapps</span><span style="color: #bc8f8f;">"</span>
            <span style="color: #b8860b;">unpackWARs</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">autoDeploy</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>
            <span style="color: #b8860b;">xmlValidation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">xmlNamespaceAware</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span>&gt;

        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> SingleSignOn valve, share authentication between web applications
             Documentation at: /docs/config/valve.html </span><span style="color: #b22222;">--&gt;</span>
        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
        &lt;Valve className="org.apache.catalina.authenticator.SingleSignOn" /&gt;
        </span><span style="color: #b22222;">--&gt;</span>

        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Access log processes all example.
             Documentation at: /docs/config/valve.html </span><span style="color: #b22222;">--&gt;</span>
        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">
        &lt;Valve className="org.apache.catalina.valves.AccessLogValve" directory="logs"  
               prefix="localhost_access_log." suffix=".txt" pattern="common" resolveHosts="false"/&gt;
        </span><span style="color: #b22222;">--&gt;</span>

      &lt;/<span style="color: #0000ff;">Host</span>&gt;
    &lt;/<span style="color: #0000ff;">Engine</span>&gt;
  &lt;/<span style="color: #0000ff;">Service</span>&gt;
&lt;/<span style="color: #0000ff;">Server</span>&gt;
</pre>



</div>

</div>
