lod2authstatwb/doc/webid.org
** web.xml
#+begin_src xml
<?xml version="1.0" encoding="UTF-8"?>
<web-app xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://java.sun.com/xml/ns/javaee" xmlns:web="http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd" xsi:schemaLocation="http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd" id="WebApp_ID" version="2.5">
        <display-name>LOD2 stack demonstrator</display-name>
        <context-param>
                <description>Vaadin production mode</description>
                <param-name>productionMode</param-name>
                <param-value>false</param-value>
        </context-param>
        <servlet>
                <servlet-name>LOD2 Demo Servlet</servlet-name>
                <!--<servlet-class>com.vaadin.terminal.gwt.server.ApplicationServlet</servlet-class> -->
                <servlet-class>eu.lod2.LOD2DemoServlet</servlet-class> 
                <init-param>
                        <description>Vaadin application class to start</description>
                        <param-name>application</param-name>
                        <param-value>eu.lod2.LOD2Demo</param-value>
		</init-param>
        <init-param>
    	<param-name>widgetset</param-name>
    	<param-value>eu.lod2.widgetset.LOD2Demo</param-value>
	</init-param>
        </servlet>
        <servlet>
                <servlet-name>LOD2 Demo Stat Servlet</servlet-name>
                <!--<servlet-class>com.vaadin.terminal.gwt.server.ApplicationServlet</servlet-class> -->
                <servlet-class>eu.lod2.stat.StatLOD2DemoServlet</servlet-class> 
                <init-param>
                        <description>Vaadin application class to start</description>
                        <param-name>application</param-name>
                        <param-value>eu.lod2.stat.StatLOD2Demo</param-value>
		</init-param>
        <init-param>
    	<param-name>widgetset</param-name>
    	<param-value>eu.lod2.widgetset.LOD2Demo</param-value>
	</init-param>
        </servlet>
        <servlet-mapping>
                <servlet-name>LOD2 Demo Stat Servlet</servlet-name>
                <url-pattern>/stat/*</url-pattern>
        </servlet-mapping>
        <servlet-mapping>
                <servlet-name>LOD2 Demo Servlet</servlet-name>
                <url-pattern>/*</url-pattern>
        </servlet-mapping>
        <servlet-mapping>
                <servlet-name>LOD2 Demo Servlet</servlet-name>
		<url-pattern>/VAADIN/*</url-pattern>
        </servlet-mapping>
    <security-constraint>
        <display-name>Stat</display-name>
        <web-resource-collection>
            <web-resource-name>stat</web-resource-name>
            <url-pattern>/stat/*</url-pattern>
        </web-resource-collection>
        <auth-constraint>
            <role-name>http://demo.lod2.eu/Role/Administrator</role-name>
        </auth-constraint>
        <user-data-constraint>
            <transport-guarantee>CONFIDENTIAL</transport-guarantee>
        </user-data-constraint>
    </security-constraint>
    <security-role>
	<role-name>http://demo.lod2.eu/Role/Administrator</role-name>
    </security-role>
</web-app>
#+end_src
** context.xml
#+begin_src xml
<?xml version="1.0" encoding="UTF-8"?>
<Context antiJARLocking="true" path="/lod2statworkbench">
    <Valve className="org.apache.catalina.authenticator.SSLAuthenticator"/>
    <Realm className="com.turnguard.webid.tomcat.realm.WebIDRealm" resourceName="WebIDDatabase" validate="false"/>
</Context>
#+end_src

