lod2authstatwb/doc/webid.html

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> web.xml </h3>
<div class="outline-text-3" id="text-4.2">




<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #b8860b;">version</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1.0</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">encoding</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UTF-8</span><span style="color: #bc8f8f;">"</span>?&gt;
&lt;<span style="color: #0000ff;">web-app</span> <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">xsi</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2001/XMLSchema-instance</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">xmlns</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://java.sun.com/xml/ns/javaee</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">web</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">xsi</span>:<span style="color: #b8860b;">schemaLocation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">WebApp_ID</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">version</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">2.5</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #0000ff;">display-name</span>&gt;LOD2 stack demonstrator&lt;/<span style="color: #0000ff;">display-name</span>&gt;
        &lt;<span style="color: #0000ff;">context-param</span>&gt;
                &lt;<span style="color: #0000ff;">description</span>&gt;Vaadin production mode&lt;/<span style="color: #0000ff;">description</span>&gt;
                &lt;<span style="color: #0000ff;">param-name</span>&gt;productionMode&lt;/<span style="color: #0000ff;">param-name</span>&gt;
                &lt;<span style="color: #0000ff;">param-value</span>&gt;false&lt;/<span style="color: #0000ff;">param-value</span>&gt;
        &lt;/<span style="color: #0000ff;">context-param</span>&gt;
        &lt;<span style="color: #0000ff;">servlet</span>&gt;
                &lt;<span style="color: #0000ff;">servlet-name</span>&gt;LOD2 Demo Servlet&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
                <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">&lt;servlet-class&gt;com.vaadin.terminal.gwt.server.ApplicationServlet&lt;/servlet-class&gt; </span><span style="color: #b22222;">--&gt;</span>
                &lt;<span style="color: #0000ff;">servlet-class</span>&gt;eu.lod2.LOD2DemoServlet&lt;/<span style="color: #0000ff;">servlet-class</span>&gt; 
                &lt;<span style="color: #0000ff;">init-param</span>&gt;
                        &lt;<span style="color: #0000ff;">description</span>&gt;Vaadin application class to start&lt;/<span style="color: #0000ff;">description</span>&gt;
                        &lt;<span style="color: #0000ff;">param-name</span>&gt;application&lt;/<span style="color: #0000ff;">param-name</span>&gt;
                        &lt;<span style="color: #0000ff;">param-value</span>&gt;eu.lod2.LOD2Demo&lt;/<span style="color: #0000ff;">param-value</span>&gt;
                &lt;/<span style="color: #0000ff;">init-param</span>&gt;
        &lt;<span style="color: #0000ff;">init-param</span>&gt;
        &lt;<span style="color: #0000ff;">param-name</span>&gt;widgetset&lt;/<span style="color: #0000ff;">param-name</span>&gt;
        &lt;<span style="color: #0000ff;">param-value</span>&gt;eu.lod2.widgetset.LOD2Demo&lt;/<span style="color: #0000ff;">param-value</span>&gt;
        &lt;/<span style="color: #0000ff;">init-param</span>&gt;
        &lt;/<span style="color: #0000ff;">servlet</span>&gt;
        &lt;<span style="color: #0000ff;">servlet</span>&gt;
                &lt;<span style="color: #0000ff;">servlet-name</span>&gt;LOD2 Demo Stat Servlet&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
                <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">&lt;servlet-class&gt;com.vaadin.terminal.gwt.server.ApplicationServlet&lt;/servlet-class&gt; </span><span style="color: #b22222;">--&gt;</span>
                &lt;<span style="color: #0000ff;">servlet-class</span>&gt;eu.lod2.stat.StatLOD2DemoServlet&lt;/<span style="color: #0000ff;">servlet-class</span>&gt; 
                &lt;<span style="color: #0000ff;">init-param</span>&gt;
                        &lt;<span style="color: #0000ff;">description</span>&gt;Vaadin application class to start&lt;/<span style="color: #0000ff;">description</span>&gt;
                        &lt;<span style="color: #0000ff;">param-name</span>&gt;application&lt;/<span style="color: #0000ff;">param-name</span>&gt;
                        &lt;<span style="color: #0000ff;">param-value</span>&gt;eu.lod2.stat.StatLOD2Demo&lt;/<span style="color: #0000ff;">param-value</span>&gt;
                &lt;/<span style="color: #0000ff;">init-param</span>&gt;
        &lt;<span style="color: #0000ff;">init-param</span>&gt;
        &lt;<span style="color: #0000ff;">param-name</span>&gt;widgetset&lt;/<span style="color: #0000ff;">param-name</span>&gt;
        &lt;<span style="color: #0000ff;">param-value</span>&gt;eu.lod2.widgetset.LOD2Demo&lt;/<span style="color: #0000ff;">param-value</span>&gt;
        &lt;/<span style="color: #0000ff;">init-param</span>&gt;
        &lt;/<span style="color: #0000ff;">servlet</span>&gt;
        &lt;<span style="color: #0000ff;">servlet-mapping</span>&gt;
                &lt;<span style="color: #0000ff;">servlet-name</span>&gt;LOD2 Demo Stat Servlet&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
                &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/stat/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
        &lt;/<span style="color: #0000ff;">servlet-mapping</span>&gt;
        &lt;<span style="color: #0000ff;">servlet-mapping</span>&gt;
                &lt;<span style="color: #0000ff;">servlet-name</span>&gt;LOD2 Demo Servlet&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
                &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
        &lt;/<span style="color: #0000ff;">servlet-mapping</span>&gt;
        &lt;<span style="color: #0000ff;">servlet-mapping</span>&gt;
                &lt;<span style="color: #0000ff;">servlet-name</span>&gt;LOD2 Demo Servlet&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
                &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/VAADIN/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
        &lt;/<span style="color: #0000ff;">servlet-mapping</span>&gt;
    &lt;<span style="color: #0000ff;">security-constraint</span>&gt;
        &lt;<span style="color: #0000ff;">display-name</span>&gt;Stat&lt;/<span style="color: #0000ff;">display-name</span>&gt;
        &lt;<span style="color: #0000ff;">web-resource-collection</span>&gt;
            &lt;<span style="color: #0000ff;">web-resource-name</span>&gt;stat&lt;/<span style="color: #0000ff;">web-resource-name</span>&gt;
            &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/stat/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
        &lt;/<span style="color: #0000ff;">web-resource-collection</span>&gt;
        &lt;<span style="color: #0000ff;">auth-constraint</span>&gt;
            &lt;<span style="color: #0000ff;">role-name</span>&gt;http://demo.lod2.eu/Role/Administrator&lt;/<span style="color: #0000ff;">role-name</span>&gt;
        &lt;/<span style="color: #0000ff;">auth-constraint</span>&gt;
        &lt;<span style="color: #0000ff;">user-data-constraint</span>&gt;
            &lt;<span style="color: #0000ff;">transport-guarantee</span>&gt;CONFIDENTIAL&lt;/<span style="color: #0000ff;">transport-guarantee</span>&gt;
        &lt;/<span style="color: #0000ff;">user-data-constraint</span>&gt;
    &lt;/<span style="color: #0000ff;">security-constraint</span>&gt;
    &lt;<span style="color: #0000ff;">security-role</span>&gt;
        &lt;<span style="color: #0000ff;">role-name</span>&gt;http://demo.lod2.eu/Role/Administrator&lt;/<span style="color: #0000ff;">role-name</span>&gt;
    &lt;/<span style="color: #0000ff;">security-role</span>&gt;
&lt;/<span style="color: #0000ff;">web-app</span>&gt;
</pre>



</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3"><span class="section-number-3">4.3</span> context.xml </h3>
<div class="outline-text-3" id="text-4.3">




<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #b8860b;">version</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1.0</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">encoding</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UTF-8</span><span style="color: #bc8f8f;">"</span>?&gt;
&lt;<span style="color: #0000ff;">Context</span> <span style="color: #b8860b;">antiJARLocking</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">path</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/lod2statworkbench</span><span style="color: #bc8f8f;">"</span>&gt;
    &lt;<span style="color: #0000ff;">Valve</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.apache.catalina.authenticator.SSLAuthenticator</span><span style="color: #bc8f8f;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">Realm</span> <span style="color: #b8860b;">className</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">com.turnguard.webid.tomcat.realm.WebIDRealm</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">resourceName</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">WebIDDatabase</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">validate</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span>/&gt;
&lt;/<span style="color: #0000ff;">Context</span>&gt;
</pre>




</div>

</div>
