lod2authstatwb/doc/webid.html

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4"><span class="section-number-3">4.4</span> tomcat-users.rdf </h3>
<div class="outline-text-3" id="text-4.4">




<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #b8860b;">version</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1.0</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">encoding</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UTF-8</span><span style="color: #bc8f8f;">"</span>?&gt;
&lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">RDF</span> 
  <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">base</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://schema.turnguard.com/webid/2.0/core</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">rdf</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/1999/02/22-rdf-syntax-ns#</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">rdfs</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2000/01/rdf-schema#</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">owl</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">vs</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2003/06/sw-vocab-status/ns#</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">foaf</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://xmlns.com/foaf/0.1/</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">dc</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://purl.org/dc/elements/1.1/</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">void</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://rdfs.org/ns/void#</span><span style="color: #bc8f8f;">"</span>
  <span style="color: #da70d6;">xmlns</span>:<span style="color: #b8860b;">webid</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://schema.turnguard.com/webid/2.0/core#</span><span style="color: #bc8f8f;">"</span>
&gt;

    &lt;<span style="color: #da70d6;">owl</span>:<span style="color: #0000ff;">Ontology</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://schema.turnguard.com/webid/2.0/core</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">title</span>&gt;WebID UserDatabase Realm&lt;/<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">title</span>&gt;        
        &lt;<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">creator</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">https://my-profile.eu/people/karel.kremer/card#me</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">format</span>&gt;application/rdf+xml&lt;/<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">format</span>&gt;
        &lt;<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">rights</span>&gt;Copyright &#169; 2011 www.turnguard.com&lt;/<span style="color: #da70d6;">dc</span>:<span style="color: #0000ff;">rights</span>&gt;                 
    &lt;/<span style="color: #da70d6;">owl</span>:<span style="color: #0000ff;">Ontology</span>&gt;


    &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#User</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#Class</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A user&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;   
    &lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span>&gt;

    &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Role</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#Class</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A role&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;   
    &lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span>&gt;

    &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Group</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#Class</span><span style="color: #bc8f8f;">"</span>/&gt;   
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A group&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;   
    &lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">Class</span>&gt;

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Properties </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#hasUser</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#ObjectProperty</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A resource has a certain user&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">range</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#User</span><span style="color: #bc8f8f;">"</span> /&gt;        
    &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span>&gt;

    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#hasRole</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#ObjectProperty</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A resource has a certain role&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">range</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Role</span><span style="color: #bc8f8f;">"</span> /&gt;        
    &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span>&gt;

    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#hasGroup</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://www.w3.org/2002/07/owl#ObjectProperty</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;A resource has a certain group&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">range</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Group</span><span style="color: #bc8f8f;">"</span> /&gt;        
    &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Property</span>&gt;


    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Roles </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://demo.lod2.eu/Role/Administrator</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Role</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;Administrator&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
    &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span>&gt;
    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://demo.lod2.eu/Role/User</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#Role</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;User&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
    &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span>&gt;

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Users </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">about</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">https://my-profile.eu/people/karel.kremer/card#me</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">type</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">#User</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span> <span style="color: #da70d6;">xml</span>:<span style="color: #b8860b;">lang</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">en</span><span style="color: #bc8f8f;">"</span>&gt;Karel&lt;/<span style="color: #da70d6;">rdfs</span>:<span style="color: #0000ff;">label</span>&gt;
        &lt;<span style="color: #da70d6;">webid</span>:<span style="color: #0000ff;">hasRole</span> <span style="color: #da70d6;">rdf</span>:<span style="color: #b8860b;">resource</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">http://demo.lod2.eu/Role/Administrator</span><span style="color: #bc8f8f;">"</span>/&gt;
   &lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">Description</span>&gt;
&lt;/<span style="color: #da70d6;">rdf</span>:<span style="color: #0000ff;">RDF</span>&gt;
</pre>



</div>
</div>

</div>
